-- Вставка данных в таблицу tblClient
INSERT INTO public.tblClient (ClientId, Name) VALUES
(1, 'Иванов Иван Иванович'),
(2, 'Петров Петр Петрович'),
(3, 'Кузнецова Анна Андреевна'),
(4, 'Тихонова Светлана Анатольевна');

-- Вставка данных в таблицу tblClientPayments
INSERT INTO public.tblClientPayments (ClientId, PaymentDate, PaymentSum) VALUES
(1, '2022-02-01', 4000),
(1, '2022-02-05', 6000),
(3, '2022-03-02', 10000),
(4, '2022-03-09', 1000),
(1, '2022-03-16', 2000);

-- Вставка данных в таблицу tblClosePrice
INSERT INTO public.tblClosePrice (PriceDate, PriceAssetId, ClosePrice) VALUES
('2021-01-01', 1, 100.00),
('2021-01-15', 1, 110.00),
('2021-01-20', 1, 105.00),
('2021-02-01', 1, 120.00),
('2021-02-15', 1, 115.00),
('2021-03-01', 1, 130.00),
('2021-03-15', 1, 125.00),
('2021-01-05', 2, 200.00),
('2021-01-25', 2, 210.00),
('2021-02-05', 2, 220.00),
('2021-02-25', 2, 215.00),
('2021-03-05', 2, 230.00),
('2021-03-25', 2, 225.00);
